[Killed] BlockStatement
mutation-testing/stryker-demo/src/index.js:1:51
-export default function sumOfEvenNumbers(numbers) {
-  if (!numbers && !Array.isArray(numbers)) {
-    throw new Error('Parameter numbers must be an array of numbers');
-  }
-
-  let sum = 0;
-
-  for (let number of numbers) {
-    if (number % 2 === 0) {
-      sum += number;
-    }
-  }
-
-  return sum;
-}
+export default function sumOfEvenNumbers(numbers) {}

[Killed] BooleanLiteral
mutation-testing/stryker-demo/src/index.js:2:19
 export default function sumOfEvenNumbers(numbers) {
-  if (!numbers && !Array.isArray(numbers)) {
+  if (!numbers && Array.isArray(numbers)) {
     throw new Error('Parameter numbers must be an array of numbers');
   }

[Killed] BooleanLiteral
mutation-testing/stryker-demo/src/index.js:2:7
 export default function sumOfEvenNumbers(numbers) {
-  if (!numbers && !Array.isArray(numbers)) {
+  if (numbers && !Array.isArray(numbers)) {
     throw new Error('Parameter numbers must be an array of numbers');
   }

[Killed] BlockStatement
mutation-testing/stryker-demo/src/index.js:8:31
 
   let sum = 0;
 
-  for (let number of numbers) {
-    if (number % 2 === 0) {
-      sum += number;
-    }
-  }
+  for (let number of numbers) {}
 
   return sum;

[Killed] EqualityOperator
mutation-testing/stryker-demo/src/index.js:9:9
   let sum = 0;
 
   for (let number of numbers) {
-    if (number % 2 === 0) {
+    if (number % 2 !== 0) {
       sum += number;
     }

[Killed] ConditionalExpression
mutation-testing/stryker-demo/src/index.js:9:9
   let sum = 0;
 
   for (let number of numbers) {
-    if (number % 2 === 0) {
+    if (true) {
       sum += number;
     }
